; domain
(define (domain Waste_domain)
  (:requirements :strips :typing)

  ;; Types
  (:types
    DustBin location Bags Room Human garbageSubstance - object
    organicBin paperBin plasticBin - DustBin
    newBag oldBag - Bags
    
    
  )

  ;; Predicates
  (:predicates
   
    (is_loc ?obj - object ?loc - location)  ; Object is at a location
    
    (have_garbage ?garbage - garbageSubstance)
   
    (garbage_in_bin ?garbage - garbageSubstance ?bin - DustBin)
    
    (bin_full ?bin - DustBin)
    (bin_half ?bin - DustBin)
    (bin_clear ?bin - DustBin)
    
    (have_newBag ?bag - newBag)
    (have_oldBag ?bag - oldBag)
    
    

  )

  ;; Actions
  (:action Move_To_Bin
    :parameters (?who - Human ?bin - DustBin ?garbage - garbageSubstance ?from - location ?to - location)
    :precondition (and (have_garbage ?garbage)(is_loc ?who ?from)(is_loc ?bin ?to))
    :effect (and (not (is_loc ?who ?from))(is_loc ?who ?to) )
   )
   
   
   (:action Move_From_Bin
    :parameters (?who - Human ?bin - DustBin ?garbage - garbageSubstance ?to - location ?from - location)
    :precondition (and (garbage_in_bin ?garbage ?bin)(is_loc ?who ?to)(is_loc ?bin ?to))
    :effect (and (not (is_loc ?who ?to))(is_loc ?who ?from) )
   )
   
   
   (:action Move_To_Room
    :parameters (?who - Human ?room - Room ?garbage - garbageSubstance ?from - location ?to - location)
    :precondition (and (is_loc ?who ?from)(is_loc ?garbage ?to)(is_loc ?room ?to))
    :effect (and (not (is_loc ?who ?from))(is_loc ?who ?to)(have_garbage ?garbage)(not(is_loc ?garbage ?to)))
   )
  
  
  (:action Empty_Half_Trashed
     :parameters (?who - Human ?bin - DustBin ?garbage - garbageSubstance ?pos - location)
     :precondition (and(have_garbage ?garbage)(bin_clear ?bin)(is_loc ?who ?pos)(is_loc ?bin ?pos))
     :effect (and(not(have_garbage ?garbage))(not(bin_clear ?bin))(bin_half ?bin)(garbage_in_bin ?garbage ?bin))
  )
  
  (:action Half_Full_Trashed
     :parameters (?who - Human ?bin - DustBin ?garbage - garbageSubstance ?pos - location)
     :precondition (and(have_garbage ?garbage)(bin_half ?bin)(is_loc ?who ?pos)(is_loc ?bin ?pos))
     :effect (and(not(have_garbage ?garbage))(not(bin_half ?bin))(bin_full ?bin)(garbage_in_bin ?garbage ?bin))
  )
  
  (:action Full_Empty_Trashed
     :parameters (?who - Human ?bin - DustBin ?NewBag - newBag ?OldBag - oldBag ?pos - location)
     :precondition (and(have_newBag ?NewBag)(bin_full ?bin)(is_loc ?who ?pos)(is_loc ?bin ?pos))
     :effect (and(not(have_newBag ?NewBag))(not(bin_full ?bin))(bin_clear ?bin)(have_oldBag ?OldBag))
  )
  
  (:action Move_To_NewBag
     :parameters (?who - Human ?bin - DustBin ?NewBag - newBag ?from - location ?to - location)
     :precondition (and(bin_full ?bin)(is_loc ?who ?from)(is_loc ?NewBag ?to))
     :effect (and(not(is_loc ?who ?from))(have_newBag ?NewBag)(is_loc ?who ?to))
  )
  
  
)

; problem
(define (problem Waste_problem)
  (:domain Waste_domain)

  ;; Objects
  (:objects
    organic_bin - organicBin
    paper_bin - paperBin
    plastic_bin - plasticBin
    organic plastic paper - garbageSubstance
    ;bag - Bags
    NewBag - newBag
    OldBag - oldBag
    room - Room
    
    pos_1 pos_2 pos_3 pos_4 pos_5 pos_6 - location  ; Existing locations from your code
    person - Human
  )

  ;; Initial State
  (:init
    
    (is_loc person pos_1) 
    (is_loc paper_bin pos_2)
    (is_loc plastic_bin pos_3)
    (is_loc organic_bin pos_4)
    (is_loc NewBag pos_5)
    (is_loc room pos_6)
    (is_loc organic pos_6)
    
    
    ;(have_garbage organic)
    (bin_half paper_bin)
    (bin_half plastic_bin)
    (bin_half organic_bin)
    
    
    ;(have_newBag bag)
     
  )

  ;; Goal State
  (:goal
    (and (is_loc person pos_1)
    	 (garbage_in_bin organic organic_bin)
    	 
    	
    	 ) ; Waste should be at location pos_4
  )
)

; plan
1. (move_to_room person room organic pos_1 pos_6)
   deleted: (is_loc person pos_1) (is_loc organic pos_6)
   added: (is_loc person pos_6) (have_garbage organic)
   goals met: 0 of 2
2. (move_to_bin person organic_bin organic pos_6 pos_4)
   deleted: (is_loc person pos_6)
   added: (is_loc person pos_4)
   goals met: 0 of 2
3. (half_full_trashed person organic_bin organic pos_4)
   deleted: (have_garbage organic) (bin_half organic_bin)
   added: (bin_full organic_bin) (garbage_in_bin organic organic_bin)
   goals met: 1 of 2
4. (move_from_bin person organic_bin organic pos_4 pos_1)
   deleted: (is_loc person pos_4)
   added: (is_loc person pos_1)
   goals met: 2 of 2
